# 2041. Accepted Candidates From the Interviews
[問題](https://leetcode.com/problems/accepted-candidates-from-the-interviews/description/?envType=study-plan-v2&envId=30-days-of-pandas&lang=pythondata)

## 解答の方針
roundsのscoreの合計を出す。
これをcandidatesにマージして、フィルタリングする。

In [1]:
import pandas as pd

In [2]:
data = [[11, 'Atticus', 1, 101], [9, 'Ruben', 6, 104], [6, 'Aliza', 10, 109], [8, 'Alfredo', 0, 107]]
candidates = pd.DataFrame(data, columns=['candidate_id', 'name', 'years_of_exp', 'interview_id']).astype({'candidate_id':'Int64', 'name':'object', 'years_of_exp':'Int64', 'interview_id':'Int64'})
data = [[109, 3, 4], [101, 2, 8], [109, 4, 1], [107, 1, 3], [104, 3, 6], [109, 1, 4], [104, 4, 7], [104, 1, 2], [109, 2, 1], [104, 2, 7], [107, 2, 3], [101, 1, 8]]
rounds = pd.DataFrame(data, columns=['interview_id', 'round_id', 'score']).astype({'interview_id':'Int64', 'round_id':'Int64', 'score':'Int64'})

In [28]:
def accepted_candidates(candidates: pd.DataFrame, rounds: pd.DataFrame) -> pd.DataFrame:
    score_sum = rounds.groupby("interview_id")["score"].sum().reset_index(name="sum")
    integrated = candidates.merge(score_sum, on="interview_id")
    result = integrated[(integrated["sum"] > 15) & (integrated["years_of_exp"] >= 2)]["candidate_id"].reset_index()
    return result[["candidate_id"]]

In [29]:
accepted_candidates(candidates, rounds)

   candidate_id
0             9

## test scripts

In [4]:
candidates

   candidate_id     name  years_of_exp  interview_id
0            11  Atticus             1           101
1             9    Ruben             6           104
2             6    Aliza            10           109
3             8  Alfredo             0           107

In [5]:
rounds

    interview_id  round_id  score
0            109         3      4
1            101         2      8
2            109         4      1
3            107         1      3
4            104         3      6
5            109         1      4
6            104         4      7
7            104         1      2
8            109         2      1
9            104         2      7
10           107         2      3
11           101         1      8

In [8]:
score_sum = rounds.groupby("interview_id")["score"].sum().reset_index(name="sum")

In [9]:
score_sum

   interview_id  sum
0           101   16
1           104   22
2           107    6
3           109   10

In [10]:
integrated = candidates.merge(score_sum, on="interview_id")

In [11]:
integrated

   candidate_id     name  years_of_exp  interview_id  sum
0            11  Atticus             1           101   16
1             9    Ruben             6           104   22
2             6    Aliza            10           109   10
3             8  Alfredo             0           107    6

In [17]:
result = integrated[(integrated["sum"] > 15) & (integrated["years_of_exp"] >= 2)]["candidate_id"].reset_index(name="candidate_id")

In [19]:
result[["candidate_id"]]

   candidate_id
0             9